// Завдання 1:

//  Написати тест на довільну тему з 10-ти питань.
//  Якщо користувач відповідає вірно додаємо бал.
//  Якщо відповідає не вірно тоді нічого не робимо.
//   В кінці виводимо статистику про кількість правильних відповідей з можливих 10.
//    І повідомлення для користувача про рівень знань відносно набраних балів.

let count = 0;
console.log("count =", count);
let ask_1 = prompt(
  `1.Дельфіни сплять із одним відкритим оком?Відповідь yes або no`);
if (ask_1 == "yes") {
  console.log(
    "1.Дельфіни сплять з одним відкритим оком через те, що дві півкулі мозку дельфіна сплять не одночасно"
  );
  count++;
}
else if(ask_1 =='no'){
    console.log(
        "1.Дельфіни сплять з одним відкритим оком через те, що дві півкулі мозку дельфіна сплять не одночасно"
      );  
}

  let ask_2 = prompt(`2. Bосьминіг  має серцe?`);
  if (ask_2 == "yes") {
    console.log("2.Восьминіг має три серця.");
    count++;
  }
  else if(ask_2 =='no'){
    console.log("2.Восьминіг має три серця."); 
}

let ask_3 = prompt(`3.У жирафа у шиї 21 хребець?`);
if (ask_3 == "no") {
  console.log("3.У жирафа в шиї 7 хребців, як у людини чи будь-якого іншого ссавця.");
  count++;
}
else if(ask_3 =='yes'){
  console.log("3.У жирафа в шиї 7 хребців, як у людини чи будь-якого іншого ссавця."); 
}

let ask_4 = prompt(`4.Лелеки можуть засипати на льоту?`);
if (ask_4 == "yes") {
  console.log("4.Лелеки можуть спати на льоту до 10 хв.");
  count++;
}
else if(ask_4 =='no'){
  console.log("4.Лелеки можуть спати на льоту до 10 хв."); 
}

let ask_5 = prompt(`5.Чи правда, що акула є смертельною істотою у світі?`);
if (ask_5 == "no") {
  console.log("5.Найсмертельнішою істотою є самка малярійного комара.");
  count++;
}
else if(ask_5 =='yes'){
  console.log("5.Найсмертельнішою істотою є самка малярійного комара."); 
}

let ask_6 = prompt(`6.Зелений колір викликає почуття голоду?`);
if (ask_6 == "no") {
  console.log("6.Науково доведено, що почуття голоду спричиняє червоний колір.");
  count++;
}
else if(ask_6 =='yes'){
  console.log("6.Науково доведено, що почуття голоду спричиняє червоний колір."); 
}

let ask_7 = prompt(`7.Чи правда, що у кажанів прямокутні зіниці?`);
if (ask_7 == "no") {
  console.log("7.Тільки у кіз, овець та восьминогів прямокутні зіниці.");
  count++;
}
else if(ask_7 =='yes'){
  console.log("7.Тільки у кіз, овець та восьминогів прямокутні зіниці."); 
}

let ask_8 = prompt(`8.Кролики можуть дивитися лише вперед?`);
if (ask_8 == "no") {
  console.log("8.У кроликів зір влаштований так, що вони можуть бачити те, що відбувається у них за спиною, не повертаючи голови.");
  count++;
}
else if(ask_8 =='yes'){
  console.log("8.У кроликів зір влаштований так, що вони можуть бачити те, що відбувається у них за спиною, не повертаючи голови."); 
}

let ask_9 = prompt(`9.Яблука, картопля та цибуля мають однаковий смак, якщо закрити ніс?`);
if (ask_9 == "yes") {
  console.log("9.Яблука, картопля та цибуля мають однаковий смак, якщо ви їсте їх із закритим носом.");
  count++;
}
else if(ask_9 =='no'){
  console.log("9.Яблука, картопля та цибуля мають однаковий смак, якщо ви їсте їх із закритим носом."); 
}

let ask_10 = prompt(`10.Найсильніший м'яз у людини – це м'яз руки?`);
if (ask_10 == "no") {
  console.log("10.Найсильніший м'яз - це язик, так само можна віднести сюди і м'яз щелепи, який утворює тиск 122 кг.");
  count++;
}
else if(ask_10 =='yes'){
  console.log("10.Найсильніший м'яз - це язик, так само можна віднести сюди і м'яз щелепи, який утворює тиск 122 кг."); 
}

if (count>=0 && count <3){
    console.log('Читайте...світ такий цікавий');
}
else if (count>=3 && count <=6){
    console.log('Хм..Можливо ви ще не все прочитали');
}
else if (count>6 && count <=9){
    console.log('Ви знаете багато');
}
else if (count=10){
    console.log('Вітаємо ви молодець,жодної помилки!');
}
console.log("count =", count);



// Завдання 2:

//  Якщо користувач вводить «Ім’я», то питати пароль, якщо натиснув скасувати(escape) 
//  - виводити «Вхід скасований», якщо вводить щось інше - «Я вас не знаю». 

// Пароль перевіряти так. Якщо введений пароль «ЛОГОС»,
//  то виводити «Ласкаво просимо!», Інакше - «Пароль невірний»,
//   при скасуванні - «Вхід скасований».

let FirstName = prompt(`Введіть Імя`);

if (FirstName == ''){
    console.log(`Я вас не знаю`);
}
else if (FirstName == null){
    console.log(`Вхід скасований`);
}
 else if( FirstName = true){
    let password = prompt('Введіть пароль');
    if (password == 'ЛОГОС'){
        console.log(`Ласкаво просимо!`);
    }
    else if (password ==''){
        console.log(`Ви нічого не ввели`);
    }
    else if (password == null){
        console.log(`Вхід скасований`);
    }
    else {
        console.log(`Пароль невірний`);
    }
}

// Завдання 3:

// — Написати програму яка видає користувачу ввести число. 
// Після введення числа вистрибує алерт з оголошенням пори року
//  до якої відноситься число (номер місяця) що ввів користувач.
//  Якщо число не входить в діапазон від 1 до 12 тоді неможливо.

let number = prompt('Bвести число від 1 до 12');

 if (number >=1 && number <3||number >11 && number <=12 ) {
    alert('Зима');
}
else if (number >=3 && number <6){
alert('Весна');
}
else if (number >=6 && number <9) {
    alert('Лiто');
}
else if (number >=9 && number <=11) {
    alert('Осінь');
}
else{
    alert('Виконати неможливо');
}




