// Пароль і 4 спроби. Завдання виконуємо через while або do while.

// 1. Запросити у користувача пароль!

// 2. Якщо пароль не вірний повідомити що залишилось 4 спроби!

// - якщо далі невірні паролі спроби зменшуються.

// - коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".

// 3. Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!

// 4. Завдання реалізуємо без break і міток!

let pass = 123456;
let i = 5;
while (i > 0) {
  let ask = +prompt(`Введіть свій пароль,ще ${i}`);
  if (ask == pass) {
    console.log("Запрошуємо на сайт!");
  } else {
    console.log("Будь ласка спробуйте пізніше!");
  }
  i--;
}

// -------------------------------------------------------------------------------------

// 1.Створіть програму, яка обчислює факторіал натурального числа n,
// яке користувач введе з клавіатури.

let j = 1;
let n = +prompt(`Write number here...`);
while (j <= n) {
  document.write(`<h2> ${j}</h2>`);
  j++;
}

// 2.Створіть програму,
// що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

let i = 1000;
while (i <= 9999) {
  document.write(`<h2> ${i}</h2>`);
  i = i + 3;
}

// 3.Створіть програму,
// що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…

let n = -1;
let i = 1;
while (i <=55) {
  n+= 2;
  document.write(`<h2> ${n}</h2>`);
  i++;
}

// 4.Створіть програму, що виводить на екран всі невід'ємні
// елементи послідовності 90 85 80 75 70 65 60…

let i = 90;
while (i >= 0) {
  document.write(`<h2> ${i}</h2>`);
  i -= 5;
}

// 5.Створіть програму, що виводить на екран
// перші 20 елементів послідовності 2 4 8 16 32 64 128…

let i = 0;
let n = 1;
while (i < 20) {
  n = n * 2;
  document.write(`<h2> ${n}</h2>`);
  i++;
}
// 6. Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника),
//  де початкове значення a = 2 та які менше 10000.

let a = 2;
while (a < 10000) {
  document.write(`<h2> ${a}</h2>`);
  a = a * 2 - 1;
}

// 7.Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника),
//  де початкове значення змінної a = -166.

let a = -166;
while (a <= 100) {
  if (a >= -99 && a <= 99) {
    document.write(`<h2> ${a}</h2>`);
  }
  a = a * 2 + 200;
}

// 8.Написати програму що обчислює піднесення до степеня.
// В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня,
//  від'ємна або 0. Обрахувати всі можливі варіанти циклом for.
//   Задачу бажано виконати використовуючи 1 цикл!

// a^b = a*a b раз;

// a^-b= 1/a^b;

// a^0 = 1;

let a = +prompt("Введіть число");
let b = +prompt("Введіть степінь");
let result = 1;
let i = 1;
while (i <= b || i <= -b) {
  result *= a;
  if (-b > 0) {
    let i = 1;
    while (i <= b || i <= -b) {
      result *= 1 / a;
      i++;
    }
  }
  i++;
}
document.write(`<h2> ${result}</h2>`);
